Tests/Langley/Beta2p0-fine/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01; //from cm

vertices
(
    (  0.0 0.999847695156e-12 -0.0174524064373e-12)   //0
    ( 49.89 0.999847695156e-12 -0.0174524064373e-12)  //1
    ( 49.89 2.49412007557 -0.0435350278578) //2
    (  0.0 2.49412007557 -0.0435350278578)  //3
    (  0.0 0.999847695156e-12 0.0174524064373e-12)   //4
    ( 49.89 0.999847695156e-12 0.0174524064373e-12 )  //5
    ( 49.89 2.49412007557 0.0435350278578) //6
    (  0.0 2.49412007557 0.0435350278578)  //7
    (  0.0 27.4358207551 -0.478894032639)   //8
    ( 49.89 27.4358207551 -0.478894032639)  //9
    (  0.0 27.4358207551 0.478894032639)   //10
    ( 49.89 27.4358207551 0.478894032639)  //11
    ( -1.0 2.49412007557 -0.0435350278578)  //12
    ( -1.0 27.4358207551 -0.478894032639)   //13
    ( -1.0 2.49412007557 0.0435350278578)  //14
    ( -1.0 27.4358207551 0.478894032639)   //15
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 20 1) simpleGrading (3 1 1)
    hex (3 2 9 8 7 6 11 10) (200 80 1) simpleGrading (3 6 1)
    hex (12 3 8 13 14 7 10 15) (4 80 1) simpleGrading (1 6 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
            (2 9 11 6)
            (8 9 11 10)
            (12 13 15 14)
            (13 8 10 15)
        );
    }
    axes
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (12 3 7 14)
        );
    }
    wedge1
    {
        type wedge;
        faces
        (
            (0 3 2 1)
            (3 2 9 8)
            (12 3 8 13)
        );
    }
    wedge2
    {
        type wedge;
        faces
        (
            (4 5 6 7)
            (7 6 11 10)
            (14 7 10 15)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
