Tests/Langley/Beta2p0-fine/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    "(inlet).*"
    {
        type           uniformFixedValue;
        uniformValue   constant 146627;
        value          $internalField;
    }
    
    "(outlet).*"
    {
//        type            subsonicSupersonicPressureOutlet;
        type            fixedValue;
        value           $internalField;
        p0              $internalField;
        U               U;
        phi             phi;
        psi		thermo:psi;
        gamma           0.9;
        refValue	$internalField;
        refGradient	uniform 0;
        valueFraction	uniform 1;
    }
    
    ".*(walls).*"
    {
        type            zeroGradient;
    }
    
    #include "constr.include"
}

// ************************************************************************* //



